)ATTR DEFAULT(%+_)                                                     
                                                                       
)BODY EXPAND(\\)                                                       
%TUTORIAL+\-\%OUTLINE+\-\%TUTORIAL                                     
+                                                                      
+The Outline dialog processes the current source member and displays   
+a list of functions.                                                  
+                                                                      
+                                                                      
+Line Commands:                                                        
+  %S+- Select a symbol to position the editor.                        
+                                                                      
+                                                %PF3+- Return to panel
)END                                                                   